;-------------------------------------------------
.include "spr_const.hS"
;-------------------------------------------------
; Стандартный экран 256x192, знакоместа,
; атрибуты посимвольно
; Вывод спрайта без маски и без атрибутов!
;-------------------------------------------------
; Формат спрайта:
;	IX+0,1	- количество байт в спрайте SSZ, включая длину заголовка.
;		SSZ = W*H*8 + 5 байт
;	IX+2	- ширина спрайта W (знакоместа)
;	IX+3	- высота спрайта H (знакоместа)
;	IX+4	- W*H*8 байт - данные спрайта построчно
;
;	- Данные распологаются построчно -
;
;	0 ...... W-1	;
;	0 ...... W-1	;
;	  ......	; H строк
;	0 ...... W-1	;
;-------------------------------------------------
	.globl sprXYtoHL
	.globl sprXYtoHLattr
	.globl scr_down_hl
	
        .module spr0_out0_s
	.area	_CODE
;-------------------------------------------------
; Процедура вывода спрайта без атрибутов. Базовая 
; Вход:
;	L=x, H=y
;	IX - Адрес спрайта
;-------------------------------------------------
.globl spr0_out0
spr0_out0:
	; Определяем адрес в экранной области
	call	sprXYtoHL

	; DE - данные спрайта
	push	ix
	ld	de,#4
	add	ix,de
	push	ix
	pop	de
	pop	ix
	
	; Ширина спрайта
	ld	c,2(ix)
	; Высота спрайта
	ld	a,3(ix)
	add	a
	add	a
	add	a
	ld	b,a ; h*8 (в строках)
spr0_out0_hline:	; Начало цикла по строкам
	push	bc

	
	; выводим w байт (одну линию)
	push	hl
spr0_out0_line:
	ld	a,(de)
	; Вместо nop можно воткнуть xor (hl), and (hl) или or (hl)
spr0_out0_opt:
	nop
	;
	ld	(hl),a
	inc	hl
	inc	de
	dec	c
	jr nz,	spr0_out0_line
	pop	hl
	; Следующая строка на одну ниже
	call	scr_down_hl
	; Вывод в ту же треть экрана
	pop	bc
	djnz	spr0_out0_hline	; Конец цикла по строкам (та же треть)
	; Выход, если всё
	ret
;-------------------------------------------------
; Вывод без операции (наложение с затиранием)
;-------------------------------------------------
.globl _spr0_out0_setopt_nop
_spr0_out0_setopt_nop:
	ld a,#0x00
	jr spr0_out0_setopt_ep
;-------------------------------------------------
; Вывод AND
;-------------------------------------------------
.globl _spr0_out0_setopt_and
_spr0_out0_setopt_and:
	ld a,#0xA6	; and (hl)
	jr spr0_out0_setopt_ep
;-------------------------------------------------
; Вывод OR
;-------------------------------------------------
.globl _spr0_out0_setopt_or
_spr0_out0_setopt_or:
	ld a,#0xB6	; or (hl)
	jr spr0_out0_setopt_ep
;-------------------------------------------------
; Вывод XOR
;-------------------------------------------------
.globl _spr0_out0_setopt_xor
_spr0_out0_setopt_xor:
	ld a,#0xAE	; xor (hl)
	jr spr0_out0_setopt_ep
;-------------------------------------------------
spr0_out0_setopt_ep:
	ld (spr0_out0_opt),a
	ret
;-------------------------------------------------
; Вывод атрибутов спрайта
; Вход:
;	IX - Адрес спрайта
;	L=x, H=y
;	DE - адрес атрибутов
spr0_outattr0:
	call	sprXYtoHLattr
	; Высота спрайта
	ld	b,3(ix)
	ld	c,2(ix)
spr0_outattr0_hline:	; Начало цикла по строкам
	; линия
	push	bc
	push	hl

spr0_outattr0_line:
	ld	a,(de)
	ld	(hl),a
	inc	de
	inc	hl
	dec	c
	jr nz, spr0_outattr0_line

	pop	hl
	ld	bc,#0x0020
	add	hl,bc
	pop	bc
	djnz	spr0_outattr0_hline
	;
	ret
;-------------------------------------------------
; Процедура вывода спрайта с атрибутами
; Вход:
;	L=x, H=y
;	IX - Адрес спрайта
;-------------------------------------------------
.globl spr0_out0_attr
spr0_out0_attr:
	push	hl
	call	spr0_out0
	pop	hl
	jp	spr0_outattr0
;-------------------------------------------------
